RoR Web App/app/views/pages/profile.html.erb

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT 1  [["username", "test"]]
---
                <p>about</p>
                <%= render '/components/follow_button', :user => User.find_by_username(params[:id]) %>