socify/app/controllers/home_controller.rb

SELECT  "activities".* FROM "activities"  WHERE "activities"."owner_id" IN (1)  ORDER BY "activities"."created_at" DESC LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "activities"  WHERE "activities"."id" = 'posts' AND "activities"."owner_id" IN (2, 1)
---
  def index
    @post = Post.new
    @friends = @user.all_following.unshift(@user)
    @activities = PublicActivity::Activity.where(owner_id: @friends).order(created_at: :desc).paginate(page: params[:page], per_page: 10)

SELECT  "activities".* FROM "activities"   ORDER BY "activities"."created_at" DESC LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "activities"
---
  def front
    @activities = PublicActivity::Activity.order(created_at: :desc).paginate(page: params[:page], per_page: 10)