socify/app/controllers/posts_controller.rb

  def create
    @post = current_user.posts.new(post_params)
    if @post.save
---
INSERT INTO "posts" ("content", "content_html", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["content", "yay tokes"], ["content_html", "<p>yay tokes</p>"], ["created_at", "2016-04-08 03:31:58.342921"], ["updated_at", "2016-04-08 03:31:58.342921"], ["user_id", 1]]

  def set_post
    @post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = ?  ORDER BY created_at DESC LIMIT 1  [["id", 2]]